---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.FitDirection
source: html/37d97820-8b1e-8987-d210-78f594aa76da.htm
---
# Autodesk.Revit.DB.ImageExportOptions.FitDirection Property

The fit direction. Used only if ZoomType is FitToPage.

## Syntax (C#)
```csharp
public FitDirectionType FitDirection { get; set; }
```

## Remarks
The default is Horizontal.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration